//*رد بوت ساسكي تبع ايتاتشي
// معلش ي ايتاتشي كسلت اعمل واحده 😀
// اعمل واحده بس احط رد تل

let handler = m => m; 
 handler.all = async function (m) { 

   let chat = global.db.data.chats[m.chat]; 
   let responses; 
   if (/^هلا|اهلا$/i.test(m.text)) { 
     responses = [ 
 '*هلا بيك يعمري 😩❤‍🔥*' 
 '*منور يروحي🌚💕*' 
 '*اهلين🤖*'
     ]; 
} else if (/^السلام عليكم|سلام عليكم ورحمه الله وبركاته|سلام عليكم|السلام عليكم ورحمه الله وبركاته$/i.test(m.text)) { 
     responses = [ 
       '*♥🐥وعليكم السلام*',  
     ]; 
   }else if (/^بوت|بووت|بوووت|يابوت$/i.test(m.text)) { 
     responses = [ 
'*بوت تيربو تحت امرك🤖*'
'*قلب البوت🥺💕*'
'*اي يروحي🌚♥*'
'*موجود ينجم🤖*'
'*لو مش عارف تستخدم البوت اكتب `(.اوامر)`*'
'*لو بتشوف شغال ولا لا ف نا شغال يقلبي🌚*'
'*تحت امرك حبي*',
     ]; 
 }else if (/^كل خرا|عرص|خول|متناك|كسمك|علق|يمتناك|يشرموط|يوسخ$/i.test(m.text)) { 
     responses = [ 
'*دا انتا😒*'
'*كسمك*'
'*ربنا يسامحك🤡*'
'*استغفر الله🤡*'
'*الله يهديك يشرموط🤡*'
'*متشتمش يخول😒*'
'*لو شتمتم تاني هقوم انيكك🤡*'
     ]; 
   }else if (/^حبني$/i.test(m.text)) { 
     responses = [ 
    '*مبحبش شراميط🤡*'
   ]; 
   }else if (/^بوت بتحبني؟|بوت تحبني|بتحبني|تحبني$/i.test(m.text)) { 
     responses = [ 
    '*اموت فيك 🌚💔*',
    '*اكرهك🙂💔*',
    '*احبك نص حب 🙃💔*',
]; 
   }else if (/^بوت تكرهني؟|بتكرهني|مبتحبنيش$/i.test(m.text)) { 
     responses = [ 
    '*ماعاش الي ميحبكش يقلبي 🙁*',
    '*مش بكرهك ولا بحبك انا بوت يابن الهبلة🤡*',
   '*اة بكرهك🙄*',  
    ]; 
     
     }else if (/^هالو$/i.test(m.text)) { 
     responses = [ 
       '*هالو🌚♥*',  
     ]; 
}else if (/^بحبك|احبك|حبك/i.test(m.text)) { 
     responses = [ 
       '*بحبك اكتر🌚❤*',  
       '*ونا كمان يقلبي🌚♥*'
       '*تب هنتجوز امتي🤡*'
     ]; 
   }else if (/^تتجوزني|نتجوز$/i.test(m.text)) { 
     responses = [ 
    'اقلع'
    'يلا يروحي😉'
    'يلا بس هنيكك ازاي 🤡'
     ]; 
   } else if (/^احبك|حبك$/i.test(m.text)) { 
     responses = [ 
'*مـي تو 🙂🫀*'
     ]; 
     }else if (/^عامل ايه|عامل اي|عامل اية|عاملين ايي|عامل ايي|اخباركو$/i.test(m.text)) { 
     responses = [ 
       'الحمدالله♥',  
      'اكويس🌚'
      'تمام🌚'
     ];
     }else if (/^عاملين ايي|اخباركو$/i.test(m.text)) { 
     responses = [ 
       'الحمدلله♥',  
      'اكويسين♥'
      'تمام يقلبي🌚'
     ];
     }else if (/^هاي$/i.test(m.text)) { 
     responses = [ 
       'هاي',  
     'هايات🤡'
     ];
     }else if (/^❤|♥$/i.test(m.text)) { 
     responses = [ 
       '*اعشقق♥*',  

     ];
     }else if (/^اهلين$/i.test(m.text)) { 
     responses = [ 
       '*اهلين بيك🌚*',  

     ]; 
     }else if (/^مساء|مساء|مسا$/i.test(m.text)) { 
     responses = [ 
       'مساء الخير',  

     ];
     }else if (/^صباح|صباح$/ .test(m.text)) { 
     responses = [ 
       '*صباح الورد♥*',  
     ];
       }else if (/^اوامر$/i.test(m.text)) { 
     responses = [ 
       '*متنساش النقطة قبل اوامر زي كدا (.اوامر)*',  
     ];
            }else if (/^bot$/i.test(m.text)) { 
     responses = [ 
       '*تحت امرك حبي*',  
     ];
            }else if (/^مرحبا$/i.test(m.text)) { 
     responses = [ 
       '*مرحبا♥*',  
     ];
     if (/^مين المطور|بتاع مين البوت ده|المطور|مين صاحب البوت ده$/i.test(m.text) ) { //sin prefijo 
    conn.reply(m.chat, `╭┅〘 ⚠️ الـمـطـور ⚠️ 〙*
➽🐍 EL TARBOO
➽⚜️ wa.me/+201225655220
➽💌 Owner Of bot
_*هذا رقم مطوري اذ كنت تريد ان عليك ان تدخل و تكتب رساله بدون ازعاج*_

*╰═┅ৡৢ͜͡✦═╡ *EL TARBOO* ╞═┅ৡৢ͜͡✦═╯*`, m)
}
if (/^مساعده|كيف استخدم البوت|بوت عطلان|ازاي استخدم البوت|ازاي استخدم الاوامر$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `╭┄〔 *${wm}* 〕┄⊱
┆ ——————«•»——————
┆ ☆::✧ BOT EL TARBOO 𝑾𝑯𝑨𝑻𝑺𝑨𝑷𝑷::☆
┆——————«•»——————
┆ - اهلا بك في مركز المساعدة
┆ - عليك أن تستخدم الاوامر مع رمز
┆ - مثل : ( . ) او ( # )
┆ - ثم تكتب الأمر مثل *.اوامر*
┆ - يجب أن تتأكد من استخدام الرموز
┆ - و اذا لم يظهر لك رسائل البوت
┆ - استخدم *.مهام* او *.صلح*
┆ - و لاظهار الأمر استخدم*".مهام*
┆ 
┆ 「 BOT EL TARBOO 」
╰━━━⊰ 𓃠 ${vs} ⊱━━━━დ*`, m) 
   }
   if (responses) { 
     let randomIndex = Math.floor(Math.random() * responses.length); 
     conn.reply(m.chat, responses[randomIndex], m); 
   } 
   return !0 
 }; 

 export default handler;